Mikhail-Za/trail-mate-T-display-p4-/builds/esp_idf/targets/tab5/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_TINYUSB_MSC_ENABLED=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=20
CONFIG_TASK_WDT_PANIC=y
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
# The shared IDF app shell (esp32_lvgl_idf_app_registry.cpp) references montserrat 20/24
# unconditionally since the P4 header/top-bar reflow; only montserrat 14 is compiled by
# LVGL default, which left this target unbuildable. Same fix as tdisplayp4_tft.
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
# ChaCha20-Poly1305 for team-mode AEAD (IdfTeamCrypto): off by default in ESP-IDF's
# mbedtls Kconfig; without these the link fails on mbedtls_chachapoly_auth_decrypt.
# Same fix as tdisplayp4_tft. NOTE: this target still does not build fully -- its
# CONFIG_COMPILER_OPTIMIZATION_PERF (-O2) promotes pre-existing format-truncation
# warnings to errors in old code (settings_page_components.cpp:337, meshcore_adapter);
# that cleanup is unrelated to these defaults.
CONFIG_MBEDTLS_CHACHA20_C=y
CONFIG_MBEDTLS_POLY1305_C=y
CONFIG_MBEDTLS_CHACHAPOLY_C=y
